* Org mode Learning
** Rainer Konig Screencasts
*** S01E01 - Headline & outline mode
**** Every headline starts with one or more *

**** Visibility of the headline hierarchy:
Local visibility cycling with TAB
Global visibility cycling with S-TAB

**** Increase or decrease level with < or >

**** Move up/down within a level with M-k or M-j

**** Move a headline under another top level headline
Cursor on the headline and then C-c C-w (org-refile)

*** S01E02 - ToDo Keywords
# +SEQ_TODO: NEXT (n) TODO(t) WAITING (w)
**** More keywords can be defined with a line
**** C-c C-c - Tags
**** C-c C-t - Select the next state

*** S01E03 - Schedule, deadline & agenda view
**** NEXT Scheduling is done with C-c C-s
DEADLINE: <2016-11-23 Wed +1w> SCHEDULED: <2016-11-16 Wed>
**** Deadlines are defined with C-c C-d
**** Switch to agenda view with C-a a - Don't know which is

*** S01E04 - Repeating tasks
**** To schedule a repeating task you need to modify the timestamp <2016-06-11 Sa repeat>
repeat can be 
- +1w Next occurrence in one week
- ++1w Next occurrence on the same day of the week

** Nice functions 
- org-edit-src-code
- org-edit-src-exit
- org-edit-src-abort
- org-toggle-checkbox
- org-promote-subtree
- org-demote-subtree

** Interesting packages

* Emacs packages
- [X] ace-window - better window manipulation
- [X] agressive-indent-mode
- [X] avy - hints for jump in certain point
- [X] beacon - highlight
- [ ] bookmarks+
- [ ] bm
- [X] dash? - functional library
- [ ] diff-mode
- [ ] dicover-my-major?
- [X] diff-hl?
- [X] expand-region
- [ ] eyebrowse?
- [ ] evil-smartparens
- [ ] flyspell
- [ ] helm-swoop
- [ ] git-comitj
- [ ] git-link
- [ ] git-timemachine-mode
- [X] golden-ratio
- [ ] google-translate
- [ ] origami
- [ ] perspective?
- [ ] persp-mode
- [ ] prodigy
- [ ] purpose?
- [X] relative-line-numbers
- [X] recentf
- [ ] rest-client
- [ ] skewer
- [X] smooth-scrolling
- [X] which-key
- [ ] remember-mode?
- [X] yasnippet
- [ ] modeline
- [X] flycheck-tooltip
- [ ] ztree

# Org
- [ ] org-download
- [ ] org-pomodoro
- [ ] org-projectile
- [ ] org-capture

* Tasks
** DONE expand-region not working
   CLOSED: [2016-12-24 Sat 02:35]
** Download theme base16 automatically
** Verification of font installation
If Source Code Pro is not installed, fallback to Ubuntu Mono
** E-mail
** Feed
** Dired[-x]
** persp-mode
    :LOGBOOK:
    CLOCK: [2016-12-02 Fri 22:52]--[2016-12-02 Fri 23:59] =>  1:07
    CLOCK: [2016-11-19 Sat 16:00]--[2016-11-19 Sat 16:25] =>  0:25
    CLOCK: [2016-11-19 Sat 15:03]--[2016-11-19 Sat 15:28] =>  0:25
    CLOCK: [2016-11-19 Sat 13:36]--[2016-11-19 Sat 14:01] =>  0:25
    CLOCK: [2016-11-19 Sat 14:22]--[2016-11-19 Sat 14:47] =>  0:25
    :END:
*** Functions 
- persp-add-new
- persp-add-buffer
- persp-switch-to-buffer
- persp-prev
- persp-next
- persp-save
- persp-save-state-to-file
- persp-load-state-from-file

*** show in smart-mode-line
mode-line-format
*** Investigate window configs
** diff-hl not showing up
** Ruby
   :LOGBOOK:
   CLOCK: [2016-12-10 Sat 20:44]--[2016-12-10 Sat 21:09] =>  0:25
   CLOCK: [2016-12-10 Sat 20:14]--[2016-12-10 Sat 20:39] =>  0:25
   CLOCK: [2016-12-10 Sat 19:12]--[2016-12-10 Sat 19:37] =>  0:25
   CLOCK: [2016-12-10 Sat 11:09]--[2016-12-10 Sat 11:34] =>  0:25
   CLOCK: [2016-12-10 Sat 10:07]--[2016-12-10 Sat 10:32] =>  0:25
   CLOCK: [2016-12-10 Sat 09:37]--[2016-12-10 Sat 10:02] =>  0:25
   CLOCK: [2016-12-03 Sat 19:46]--[2016-12-03 Sat 19:56] =>  0:10
   CLOCK: [2016-12-03 Sat 11:30]--[2016-12-03 Sat 11:42] =>  0:12
   CLOCK: [2016-12-03 Sat 10:53]--[2016-12-03 Sat 10:53] =>  0:00
   :END:
** Javascript
   :LOGBOOK:
   CLOCK: [2016-12-12 Mon 23:01]--[2016-12-12 Mon 23:26] =>  0:25
   CLOCK: [2016-12-11 Sun 18:44]--[2016-12-11 Sun 19:09] =>  0:25
   CLOCK: [2016-12-11 Sun 11:39]--[2016-12-11 Sun 12:04] =>  0:25
   :END:
** DONE org-indent-mode not working
CLOSED: [2017-01-02 Mon 12:23]
** DONE Emacs Daemon
   CLOSED: [2016-12-24 Sat 02:34]
*** Daemon 
emacs --daemon
*** Client
# terminal
emacsclient -t 
# Coment
emacsclient -c
** Backup de arquivos
** DONE Markdown mode and Yaml mode
   CLOSED: [2017-01-02 Mon 12:18]
Using vanilla emacs

** DONE Ace-window -> SPC-w
   CLOSED: [2016-12-25 Sun 23:45]
** DONE Error buffer with golden-ratio
   CLOSED: [2016-12-26 Mon 00:04]

** Study how the evil-mc package
** Purpose
Main reason:
Combo with purpose?, perspective, bookmarks+

*** About
- Easy and reliable way for the user to maintain a consistent window layout
- Framework for extensions that make use of the window layout

*** Usage
- Every window or buffer has a purpose
- The purpose of a buffer doesnt change - it is determined by the purpose configuration

**** Basic usage
- Open, close and resize window layout _M-x purpose-save-window-layout_ and _M-x purpose-load-window-layout_
- Buffer will open 
- Dedicated windows: _C-c , D_
- 

*** Window disposition
**** Ruby with specs
|1| Ruby |2| Spec |3| org-mode Other-Ruby - Magit - .el  |4| Other-spec - *compilation* *rspec-compilation*

** Learn bookmark+
** daemon gives error with evil-mc
*** Disabling temporarily when in daemon
** DONE search region or symbol with projectile
CLOSED: [2017-01-07 Sat 14:08]
It was already enabled with keybinding "d" - Duh
Replacing "d" with "f"
** DONE jump to use-package declaration
CLOSED: [2017-01-07 Sat 18:13]
Also with def ruby methods and multiple folders

Multiple folders with:
#+BEGIN_SRC lisp
(helm-do-ag default-directory (list some-dir1 some-dir2))
#+END_SRC
** DONE go to window in the same frame
CLOSED: [2017-01-07 Sat 13:59]
** DONE [git] go to file in github or github
CLOSED: [2017-01-08 Sun 07:30]
** DONE browse-url-at-point shortcut
CLOSED: [2017-01-08 Sun 18:33]
** Can't open spacemacs anymore becuase it is downloading the world 
Point the packages installation to <spacemacs>/elpa
** DONE yasnippet
CLOSED: [2017-01-18 Wed 00:12]
** DONE org-mode open links with enter
CLOSED: [2017-01-08 Sun 18:34]
** switch-to-previous-buffer has to take into consideration all the other windows
** DONE es6 -> javscript-mode
CLOSED: [2017-01-08 Sun 19:08]
** DONE web-mode
** keybindings for zezin-web
** company for zezin-web
** DONE erb is opening in fundamental mode
CLOSED: [2017-01-14 Sat 22:41]
false alarm
** Docker
** DONE Location of backup files
CLOSED: [2017-01-17 Tue 22:37]
** DONE aggressive-indent-mode only in emacs lisp
CLOSED: [2017-01-17 Tue 22:47]
** Add company to yasnippet
** Add generic if chromium or chromium-browser are valid programs
** Rspec and mini-test modes
** Behavior of compilation without popwin
** DONE nginx mode
CLOSED: [2017-01-24 Ter 17:19]
